lib/places_api/places_api.rb

INSERT INTO "shops" ("type", "name", "longitude", "latitude", "rating", "opening_hours", "tel_number", "place_id", "created_at", "updated_at", "address", "photo_reference") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
def get_places_data_from_tel_number(shop)
  # API節約のため、にデータを取得済みの場合は、returnする
  return if aleady_exist?(shop)

  # FindPlaceFromText（PhoneNumber）を使用してplace_idを取得する、ない場合は名前で取得
  get_place_id_from_tel_number(shop) if shop.tel_number.present?
  get_place_id_from_name(shop) if shop.place_id.nil?
  # place_idを取得できた場合、Detailサーチで詳細情報を取得→保存する
  if shop.place_id
    get_detail_data(shop)
    shop.save